# -*- coding: utf-8 -*-

# Есть словарь кодов товаров

goods = {
    'Лампа': '12345',
    'Стол': '23456',
    'Диван': '34567',
    'Стул': '45678',
}

# Есть словарь списков количества товаров на складе.

store = {
    '12345': [
        {'quantity': 27, 'price': 42},
    ],
    '23456': [
        {'quantity': 22, 'price': 510},
        {'quantity': 32, 'price': 520},
    ],
    '34567': [
        {'quantity': 2, 'price': 1200},
        {'quantity': 1, 'price': 1150},
    ],
    '45678': [
        {'quantity': 50, 'price': 100},
        {'quantity': 12, 'price': 95},
        {'quantity': 43, 'price': 97},
    ],
}

# Рассчитать на какую сумму лежит каждого товара на складе.
#
# Вывести суммарную стоимость каждого товара на складе c помощью циклов
# То есть: всего по лампам, стульям, етс.
# Формат строки вывода: "<товар> - <кол-во> шт, стоимость <общая стоимость> руб"
#
# Алгоритм должен получиться приблизительно такой:
#
# цикл for по товарам с получением кода и названия товара
#     инициализация переменных для подсчета количества и стоимости товара
#     получение списка на складе по коду товара
#     цикл for по списку на складе
#         подсчет количества товара
#         подсчет стоимости товара
#     вывод на консоль количества и стоимости товара на складе

# TODO здесь ваш код
# for lamp in goods:
#     if lamp == 'Лампа':
#         print("Лампа " + str(store['12345'][0]['quantity']) + " шт" + " Общая стоимость " +
#               str((store['12345'][0]['quantity'] * store['12345'][0]['price'])) + " руб")
#         for desc in goods:
#             if desc == 'Стол':
#                 print(store['23456'][0]['quantity'] * store['23456'][0]['price'] + store['23456'][1]['quantity'] *
#                       store['23456'][1]['price'] )
#                 for seat in goods:
#                     if seat == 'Диван':
#                         print(store['34567'][0]['quantity'] * store['34567'][0]['price'] + store['34567'][1]['quantity']
#                               * store['34567'][1]['price'])
#                         for chear in goods:
#                             if chear == 'Стул':
#                                 print(store['45678'][0]['quantity'] * store['45678'][0]['price'] + store['45678'][1]
#                                 ['quantity'] * store['45678'][1]['price'] + store['45678'][2]['quantity'] * store['45678'][2]['price'])


for x in goods:
    for y in store:
        quantity = store[y]
        price = store[y]
        print(quantity,price)
