#!/usr/bin/env python
# -*- coding: utf-8 -*-

# Есть словарь магазинов с распродажами

shops = {
    'ашан':
        [
            {'name': 'печенье', 'price': 10.99},
            {'name': 'конфеты', 'price': 34.99},
            {'name': 'карамель', 'price': 45.99},
            {'name': 'пирожное', 'price': 67.99}
        ],
    'пятерочка':
        [
            {'name': 'печенье', 'price': 9.99},
            {'name': 'конфеты', 'price': 32.99},
            {'name': 'карамель', 'price': 46.99},
            {'name': 'пирожное', 'price': 59.99}
        ],
    'магнит':
        [
            {'name': 'печенье', 'price': 11.99},
            {'name': 'конфеты', 'price': 30.99},
            {'name': 'карамель', 'price': 41.99},
            {'name': 'пирожное', 'price': 62.99}
        ],
}

# Создайте словарь цен на продкты следующего вида (писать прямо в коде)
sweets = {
    'коровка': [
        {'shop': 'класс', 'price': 99.99},
        {'shop': 'рост', 'price': 8.99},
        {'shop': 'метро', 'price': 7.99},
        {'shop': 'атб', 'price': 6.99},
        {'shop': 'восторг', 'price': 69.99},
        {'shop': 'сильпо', 'price': 996.99},
        # TODO тут с клавиатуры введите магазины и цены (можно копипастить ;)
    ],
    'киевский торт': [
        {'shop': 'класс', 'price': 50.99},
        {'shop': 'рост', 'price': 40.99},
        {'shop': 'метро', 'price': 30.99}
    ]
    # TODO тут с клавиатуры введите другую сладость и далее словарь магазинов
}
# Указать надо только по 2 магазина с минимальными ценами
shop_1=shops["ашан"][0]['price'] + shops["ашан"][1]['price'] + shops["ашан"][2]['price'] + shops["ашан"][3]['price']
print(shop_1)
shop_2=shops["магнит"][0]['price'] + shops["магнит"][1]['price'] + shops["магнит"][2]['price'] + shops["магнит"][3]['price']
shop_3=shops["пятерочка"][0]['price'] + shops["пятерочка"][1]['price'] + shops["пятерочка"][2]['price'] + shops["пятерочка"][3]['price']
print(shop_1>shop_2)
print(shop_2>shop_3)
print(shop_1,shop_3)